export const mockTasks = [
    { id: 1, name: 'Пройти навчання кадетів-пілотів', status: 'Виконується' },
    { id: 2, name: 'Підготувати корабель до першої місії: батареї, повітря, навігація, звʼязок', status: 'Очікує' },
    { id: 3, name: 'Місія 1: Знайти заховану записку попередньої команди дослідників', status: 'Очікує' },
    { id: 4, name: 'Місія 2: Дослідити Планету Х: Знайти аптечку та інструменти', status: 'Очікує' },
    { id: 5, name: 'Термінове завдання! Ремонт головної станції', status: 'Очікує' },
    { id: 6, name: 'Місія 3: Дослідити Планету Х: Знайти карту памʼяті', status: 'Очікує' },
    { id: 7, name: 'SOS: Врятувати незнайомого землянина', status: 'Очікує' },
];

export const mockTasksDescription = [
    {
        id: 1,
        name: 'Пройти навчання кадетів',
        description: 'Щоб подорожувати у космосі потрібно багато навиків та вмінь, щоб бути готовим до будь-яких пригод та небезпек. Кожен кадет має пройти навчвння хоча б один раз. За виконання кожного завдання є винагорода. Ви можете проходити навчання багато разів і у будь-який момент місії, щоб отримати додаткові винагороди.',
        subtasks: [
            {
                id: 1,
                name: 'Спортивна підготовка',
                type: 'Виконує кожен окремо.',
                icon: 'pi-arrow-up-right',
                color: '#46edd5',
                description: 'Прострибати до контрольної точки: на двох ногах, на правій ногі, на лівій нозі. Назад можна просто прибігти, але якщо простибати і назад то, винагорода буде більша.',
                rewards: [
                    {
                        level: 'Звичайний',
                        value: '2 токени',
                    },
                    {
                        level: 'Складний',
                        value: '3 токени',
                    } 
                ]
            },
            {
                id: 2,
                name: 'Зібрати деталі',
                type: 'Виконує кожен окремо',
                icon: 'pi-share-alt',
                color: '#fdc700',
                description: 'Зібрати всі стаканчики (6-10шт виставлені на землі в рядок). Оскільки в космосі вам треба одягати скафандр, то ви можете піднімати лише один стаканчик за раз.',
                rewards: [
                    {
                        level: 'Звичайний',
                        value: '4 токенів',
                    },
                ]
            },
            {
                id: 3,
                name: 'Подолання метеоритної бурі',
                type: 'Командна робота',
                icon: 'pi-exclamation-triangle',
                color: '#ff2056',
                description: 'Стаканчики виставляються рандомно на землю. Кадети стають в рядок, командир перший і всі за ним. Кладуть руки на плечі кадета попереду. Кадет попереду має провести всю команду між стаканчиками. Якщо кадети не зачепили жодний стаканчик, вони отримують додаткову винагороду (на всіх).',
                rewards: [
                    {
                        level: 'Звичайний',
                        value: '10 токенів',
                    },
                    {
                        level: 'Складний',
                        value: '15 токенів',
                    } 
                ]
            }
        ]
    },
    { id: 2,
        name: 'Підготувати корабель до першої місії',
        description: 'Перед відправкою у першу місію потрібно уважно перевірити та підготувати корабель: повітря, батареї, навігація і звʼязок',
        subtasks: [
            {
                id: 1,
                name: 'Заміна балону з повітрям',
                type: 'Виконує Науковець',
                icon: 'pi-cloud',
                color: '#00d3f3',
                actionValue: 'dialog',
                description: 'Купіть новий балон з повітрям. Замініть балон на кораблі і введіть на планшеті код підтвердження.',
            },
            {
                id: 2,
                name: 'Заміна батареї',
                type: 'Виконує Інженер',
                icon: 'pi-cog',
                color: '#e17100',
                actionValue: 'dialog',
                description: 'Купіть нову батарею. Замініть батарею на кораблі і введіть на планшеті код підтвердження.',
            },
            {
                id: 3,
                name: 'Налаштувати навігацію',
                type: 'Виконує Навігатор',
                icon: 'pi-map-marker',
                color: '#00d492',
                actionValue: 'dialog',
                description: 'Налаштуйте систему навігації на кораблі і введіть на планшеті код підтвердження.',
            },
            {
                id: 4,
                name: 'Налаштувати звʼязок',
                type: 'Виконує Командир',
                icon: 'pi-phone',
                color: '#7c86ff',
                actionValue: 'dialog',
                description: 'Налаштуйте антени та радіозвʼязок на кораблі і введіть на планшеті код підтвердження.',
            },
        ]
    },
    { id: 3,
        name: 'Місія 1: Знайти заховану записку попередньої команди дослідників',
        description: 'Попередня команда заховала записку у відкритову космосі і закодувала її. Надсилаю вам космічний марштрут. Знайдіть та прочитайте записку. Підказка: від початку 5 і в низ.',
        subtasks: [
            {
                id: 1,
                name: 'Прилетіти на вказану на карті точку.',
                type: 'Командан робота',
                description: 'Знайти записку. Підказка: від початку 5 і в низ.',
            },
            {
                id: 2,
                name: 'Розшифрувати записку',
                type: 'Командир',
                description: 'Розшифруйте записку та вирушайте на те місце, що вказано у повідомленні.',
            },
        ]
    },
    { id: 4,
        name: 'Місія 2: Дослідити Планету Х',
        description: 'Попередня команда сказала, що тут є щось важливе, що потрібно дослідити. (ось тут щось треба придумати, щоб вон ивикопували чи щось шукали)',
        subtasks: []
    },
    { id: 5,
        name: 'Термінове завдання! Ремонт головної станції',
        description: 'Мереоритна буря пошкодила головну станцію. Генерал просить допомогти її відремонтувати.',
        subtasks: [
            {
                id: 1,
                name: 'Відремонтувати корпус станції',
                type: 'Виконує Інженер',
                icon: 'pi-cog',
                color: '#e17100',
                actionValue: 'dialog',
                description: 'Потрібно купити спеціальні деталі (листки А4 - 2шт 2купони за шт, якісь інструменти - 1-2шт - 3 купони за шт) та відремонтувати станцію',
            },
            {
                id: 2,
                name: 'Відновити герметичність станції та замінити балон з киснем',
                type: 'Виконує Науковець',
                icon: 'pi-cloud',
                color: '#00d3f3',
                actionValue: 'dialog',
                description: 'Потрібно купити герметичну стрічку для ремонту. Після цього поміняти балон з киснем.',
            },
            {
                id: 3,
                name: 'Перевірити пункт керування навігацією',
                type: 'Виконує Навігатор',
                icon: 'pi-map-marker',
                color: '#00d492',
                actionValue: 'dialog',
                description: 'Потрібно купити нову лампочку і перевірити систему навігації.',
            },
            {
                id: 4,
                name: 'Налаштувати звʼязок із Землею',
                type: 'Виконує Командир',
                icon: 'pi-phone',
                color: '#7c86ff',
                description: 'Потрібно купити і встановити нову антену. Відзвітувати перед генералом.',
            },
        ]
    },
    { id: 6,
        name: 'Місія 3: Дослідити Планету Х: Знайти карту памʼяті і розшифрувати.',
    },
    { id: 7,
        name: 'SOS: Врятувати незнайомого землянина',
        color: '#82181a',
        description: 'Чийсь корабель потрапив у саме серце метеоритної бурі та сильно постраждав. Вони постійно відправляють сигнал про допомогу, сподіваючись, що хтось їх врятує.',
        subtasks: [
            {
                id: 1,
                name: 'Знайти пошкоджений корабель',
                type: 'Командна робота',
                description: 'Сигнал дуже слабкий і система навігації не може точно визначити, де саме корабель. Всі кадети маєть допомогти.',
            },
            {
                id: 2,
                name: 'Полікувати потерпілого',
                type: 'Командна робота',
                description: 'Ви зайшли корабель і на ньому лише один пасажир. Йому потрібна медична допомога (аптечка) і вода (сочок). Врятуйте землянина!',
            },
            {
                id: 3,
                name: 'Евекуація потерпілого',
                type: 'Командна робота',
                description: 'Цей корабель зовсім розбитий, його неможливо відремонтувати. Вам потрібно забрати землянина на свій корабель та привезти його на головну станцію.',
            },
        ]
    },
];
